# Task 13.
# Пользователь вводит число N – общее количество рассматриваемых дней (1 ≤ N ≤ 100). 
# В следующих строках располагается N целых чисел. 
# Каждое число – среднесуточная температура в соответствующий день. 
# Температуры – целые числа и лежат в диапазоне от –50 до 50

# count = 0
# max = 0

# n = int(input("Введите количество дней: "))

#for dayCount in range(n) :
#    day = int(input("Введите температуру дней: "))
#    if day > 0 :
#       count += 1
#    elif count >= max :
#        max = count
#        count = 0

# if count > max :
#    max = count

# print("Max quantity of warm days is ", max)

