# Задача 22: 
# Даны два неупорядоченных набора целых чисел (может быть, с повторениями).
# Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах.
# Пользователь вводит 2 числа. n - кол-во элементов первого множества. m - кол-во элементов второго множества.
# Затем пользователь вводит сами элементы множеств.

# a = int(input('Введите количетво элементов первого множества: '))
# b = int(input('Введите количетво элементов второго множества: '))
# set_a = set()
# set_b = set()
# for i in range(a):
#    set_a.add(int(input('Введите элемент множества A: ')))
# for i in range(b):
#    set_b.add(int(input('Введите элемент множества B: ')))
# intersectionA_B = list(set_a & set_b)
# intersectionA_B.sort()
# print(intersectionA_B)


# Задача 24: 
# В фермерском хозяйстве в Карелии выращивают чернику.
# Она растет на круглой грядке, причем кусты высажены только по окружности.
# Таким образом, у каждого куста есть ровно два соседних. Всего на грядке растет N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло различное число ягод
# – на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники.
# Эта система состоит из управляющего модуля и нескольких собирающих модулей.
# Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом,
# собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод,
# которое может собрать за один заход собирающий модуль,
# находясь перед некоторым кустом заданной во входном файле грядки.

# n = int(input('Введите количество кустов черники: '))
# berries = list()
# for i in range(n):
#    berries.append(int(input('Введите количество ягод на кусте черники: ')))
# max = 0
# for i in range(1, len(berries) - 1):
#    x = berries[i-1] + berries[i] + berries[i+1]
#    if x > max:
#        max = x
# print(max)